In [2]:
import numpy as np
import pandas as pd

p = np.arange(0,28).reshape(7,4)

p

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23],
       [24, 25, 26, 27]])

In [3]:
df = pd.DataFrame(data= p , columns= " VAL1 VAL2 VAL3 VAL4" .split())

df

   VAL1  VAL2  VAL3  VAL4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

In [4]:
df["VAL1"] + df["VAL2"]

0     1
1     9
2    17
3    25
4    33
5    41
6    49
dtype: int32

In [7]:
df["VAL5"]  = df["VAL1"] + df["VAL2"]

df

   VAL1  VAL2  VAL3  VAL4  VAL5
0     0     1     2     3     1
1     4     5     6     7     9
2     8     9    10    11    17
3    12    13    14    15    25
4    16    17    18    19    33
5    20    21    22    23    41
6    24    25    26    27    49

In [8]:
df["VAL6"] = df["VAL3"] * df["VAL4"]

df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6
0     0     1     2     3     1     6
1     4     5     6     7     9    42
2     8     9    10    11    17   110
3    12    13    14    15    25   210
4    16    17    18    19    33   342
5    20    21    22    23    41   506
6    24    25    26    27    49   702

In [9]:
np.arange(28,35)

array([28, 29, 30, 31, 32, 33, 34])

In [11]:
df["VAL7"] = np.arange(28,35)

df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6  VAL7
0     0     1     2     3     1     6    28
1     4     5     6     7     9    42    29
2     8     9    10    11    17   110    30
3    12    13    14    15    25   210    31
4    16    17    18    19    33   342    32
5    20    21    22    23    41   506    33
6    24    25    26    27    49   702    34

In [13]:
df["VAL8"] = [35,36,37,38,39,40,41] #column no of elements should be same as other ones

df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6  VAL7  VAL8
0     0     1     2     3     1     6    28    35
1     4     5     6     7     9    42    29    36
2     8     9    10    11    17   110    30    37
3    12    13    14    15    25   210    31    38
4    16    17    18    19    33   342    32    39
5    20    21    22    23    41   506    33    40
6    24    25    26    27    49   702    34    41

In [14]:
import numpy as np
import pandas as pd

p = np.arange(0,28).reshape(7,4)

df = pd.DataFrame(data= p , columns= ["VAL1" ,"VAL2", "VAL3" ,"VAL4"])

df

   VAL1  VAL2  VAL3  VAL4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

In [17]:
df.drop(["VAL3" ,"VAL4"] ,  axis= 1)

   VAL1  VAL2
0     0     1
1     4     5
2     8     9
3    12    13
4    16    17
5    20    21
6    24    25

In [18]:
df #wont affect the original inplace

   VAL1  VAL2  VAL3  VAL4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

In [19]:
df.drop(["VAL3" ,"VAL4"] ,  axis= 1, inplace= True) # affect original inplace dropped columns

In [20]:
df

   VAL1  VAL2
0     0     1
1     4     5
2     8     9
3    12    13
4    16    17
5    20    21
6    24    25

In [30]:
# df.drop([3,6] , axis=0 ,inplace= True) # remember this code work one times as it affected the list in-place, here row is dropped

df

   VAL1  VAL2
0     0     1
1     4     5
4    16    17

In [32]:
#-------------null values-------------------

import numpy as np
import pandas as pd

df = pd.DataFrame({ 'VAL1' : [2 ,4, np.nan , 6, np.nan, 8, 10],
                    'VAL2' : [123 , np.nan, 456, np.nan , 789, 246, 357],
                    'VAL3' : ['France' ,'Greece', 'USA' ,'JAPAN', 'Sweden' , 'Norway', 'Turkey']})

df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   JAPAN
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [33]:
df.isnull()

    VAL1   VAL2   VAL3
0  False  False  False
1  False   True  False
2   True  False  False
3  False   True  False
4   True  False  False
5  False  False  False
6  False  False  False

In [34]:
df.isnull().sum()

VAL1    2
VAL2    2
VAL3    0
dtype: int64

In [35]:
len(df)

7

In [36]:
df.isnull().sum() / len(df) * 100

VAL1    28.571429
VAL2    28.571429
VAL3     0.000000
dtype: float64

In [37]:
df.notnull()

    VAL1   VAL2  VAL3
0   True   True  True
1   True  False  True
2  False   True  True
3   True  False  True
4  False   True  True
5   True   True  True
6   True   True  True

In [38]:
df.notnull().sum()

VAL1    5
VAL2    5
VAL3    7
dtype: int64

In [39]:
df.notnull().sum().sum()

17

In [40]:
df["VAL1"].notnull()

0     True
1     True
2    False
3     True
4    False
5     True
6     True
Name: VAL1, dtype: bool

In [42]:
df[df["VAL1"].notnull()]

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
3   6.0    NaN   JAPAN
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [43]:
df.isnull().any()

VAL1     True
VAL2     True
VAL3    False
dtype: bool

In [44]:
df.isnull().any(axis= 1)

0    False
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [45]:
condition = df.isnull().any(axis= 1)

df[condition]

   VAL1   VAL2    VAL3
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   JAPAN
4   NaN  789.0  Sweden

In [46]:
df[~condition]

   VAL1   VAL2    VAL3
0   2.0  123.0  France
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [47]:
df.notnull().all()

VAL1    False
VAL2    False
VAL3     True
dtype: bool

In [48]:
df.notnull().all(axis= 1)

0     True
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool